In [253]:
import pandas as pd

In [254]:
df = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/refs/heads/main/pandas/tests/io/data/csv/tips.csv")

In [255]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [256]:
df[['sex','smoker','day']].head(2)

      sex smoker  day
0  Female     No  Sun
1    Male     No  Sun

In [257]:
df.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [258]:
df.dtypes=='object'

total_bill    False
tip           False
sex            True
smoker         True
day            True
time           True
size          False
dtype: bool

In [259]:
df.dtypes[df.dtypes=='object']

sex       object
smoker    object
day       object
time      object
dtype: object

In [260]:
 df111 = df.dtypes[df.dtypes=='object']

In [261]:
df111

sex       object
smoker    object
day       object
time      object
dtype: object

In [262]:
type(df.dtypes)

pandas.core.series.Series

In [263]:
type(df)

pandas.core.frame.DataFrame

In [264]:
df.dtypes[df.dtypes=='object'].index

Index(['sex', 'smoker', 'day', 'time'], dtype='object')

In [265]:
df[df.dtypes[df.dtypes=='object'].index].head(5)

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [266]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [267]:
# (df.dtypes=='float64' or df.dtypes=='object') 
# # df.dtypes=='object'

In [268]:
df.dtypes[df.dtypes=='float64'].index

Index(['total_bill', 'tip'], dtype='object')

In [269]:
df[df.dtypes[df.dtypes=='float64'].index].head(5)

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [270]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [271]:
df01 = df['total_bill']
df01.head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

In [272]:
type(df['total_bill'].head(2))

pandas.core.series.Series

In [273]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [274]:
df02 = df[['total_bill','tip']]
df02.head()

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [275]:
df02['total_bill'][2:5]

2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

In [276]:
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [277]:
df['time'][2:6]

2    Dinner
3    Dinner
4    Dinner
5    Dinner
Name: time, dtype: object

In [278]:
df[df.dtypes[df.dtypes=='object'].index].head(5)[2:5]

      sex smoker  day    time
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [279]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [280]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [281]:
# unique value
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [282]:
#Duplicate value
df[df.duplicated()]

     total_bill  tip     sex smoker   day   time  size
202        13.0  2.0  Female    Yes  Thur  Lunch     2

In [283]:
df['total_bill'].nlargest()

170    50.81
212    48.33
59     48.27
156    48.17
182    45.35
Name: total_bill, dtype: float64

In [284]:
df['total_bill'].nlargest().count()

5

In [285]:
df['total_bill'].nlargest().sum()

240.92999999999998

In [292]:
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [297]:
g = df.groupby('sex')
g

In [298]:
g['sex'].count()

sex
Female     87
Male      157
Name: sex, dtype: int64

In [300]:
df.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [302]:
f = df.groupby('smoker')

In [305]:
f['smoker'].count()

smoker
No     151
Yes     93
Name: smoker, dtype: int64

In [311]:
df.dtypes[df.dtypes == 'float64']

total_bill    float64
tip           float64
dtype: object

In [319]:
df[df.dtypes[df.dtypes == 'float64'].index]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [320]:
df[df.dtypes[df.dtypes == 'int64'].index]

     size
0       2
1       3
2       3
3       2
4       4
..    ...
239     3
240     2
241     2
242     2
243     2

[244 rows x 1 columns]

In [324]:
df[df.dtypes[(df.dtypes == 'float64')|(df.dtypes == 'int64')].index]

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

In [325]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000